jlckfb/Candis-S31/examples/esp-idf/pmic/sdkconfig.defaults.esp32s31
CONFIG_IDF_TARGET=esp32s31
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Match the Factory image's conservative bus settings. EVT1 is preview silicon
# whose flash timing has not been measured, so examples without a validated
# need for QIO stay on the diagnostic image's bus configuration.
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y
